<?php

namespace App\Enums;

enum DietType: int
{
    case کاهش_وزن                      = 1;
    case افزایش_وزن                   = 2;
    case تثبیت_وزن                    = 3;
    case دیابت                        = 4;
    case بارداری                      = 5;
    case کتو                          = 6;
    case سندرم_روده_تحریک_پذیر        = 7;
    case سندرم_روده_تحریک_پذیر_افزایشی = 8;
    case رژیم_۲۱_روزه                 = 9;
    case رژیم_مدیترانه‌ای             = 10;
    /*case عادي               = 1;  // ما عندي أي مشكلة
    case عالي_البروتين      = 2;  // أبي أزيد بروتين
    case نباتي              = 3;  // أنا نباتي
    case مشاكل_القولون      = 4;  // مشاكل قولون
    case ارتفاع_الكوليسترول = 5;  // ارتفاع كوليسترول
    case السكري             = 6;  // سكري
    case فقر_الدم           = 7;  // فقر دم / نقص حديد
    case التصلب_المتعدد     = 8;  // تصلب متعدد (MS)
    case برنامج_٢١_يوم      = 9;  // برنامج 21 يوم*/

    public function label(): string
    {
        return match ($this) {
            self::کاهش_وزن => 'إنقاص الوزن',
            self::افزایش_وزن => 'زيادة الوزن',
            self::تثبیت_وزن => 'تثبيت الوزن',
            self::دیابت => 'السكري',
            self::بارداری => 'الحمل',
            self::کتو => 'كيتو',
            self::سندرم_روده_تحریک_پذیر => 'متلازمة القولون العصبي',
            self::سندرم_روده_تحریک_پذیر_افزایشی => 'متلازمة القولون العصبي لزيادة الوزن',
            self::رژیم_۲۱_روزه => 'نظام غذائي لمدة 21 يوماً',
            self::رژیم_مدیترانه‌ای => 'النظام الغذائي المتوسطي',
            /*self::عادي               => 'ما عندي أي مشكلة',
            self::عالي_البروتين      => 'أبي أزيد بروتين',
            self::نباتي              => 'أنا نباتي',
            self::مشاكل_القولون      => 'مشاكل قولون',
            self::ارتفاع_الكوليسترول => 'ارتفاع كوليسترول',
            self::السكري             => 'سكري',
            self::فقر_الدم           => 'فقر دم / نقص حديد',
            self::التصلب_المتعدد     => 'تصلب متعدد (MS)',
            self::برنامج_٢١_يوم      => 'برنامج 21 يوم',*/
        };
    }

}
