<?php

namespace App\Enums;

enum FoodType: int
{
    case عادي               = 1;  // ما عندي أي مشكلة
    case عالي_البروتين      = 2;  // أبي أزيد بروتين
    case نباتي              = 3;  // أنا نباتي
    case LiverHealth        = 4;  // صحة الكبد
    case السكري             = 5;  // سكري
    case مشاكل_القولون      = 6;  // مشاكل قولون
    case ارتفاع_الكوليسترول = 7;  // ارتفاع كوليسترول
    case فقر_الدم           = 8;  // فقر دم / نقص حديد
    case التصلب_المتعدد     = 9;  // تصلب متعدد (MS)
    case برنامج_٢١_يوم      = 10; // برنامج 21 يوم

    public function label(): string
    {
        return match($this) {
            self::عادي               => 'ما عندي أي مشكلة',
            self::عالي_البروتين      => 'أبي أزيد بروتين',
            self::نباتي              => 'أنا نباتي',
            self::LiverHealth        => 'وجبات لصحة الكبد',
            self::السكري             => 'سكري',
            self::مشاكل_القولون      => 'مشاكل قولون',
            self::ارتفاع_الكوليسترول => 'ارتفاع كوليسترول',
            self::فقر_الدم           => 'فقر دم / نقص حديد',
            self::التصلب_المتعدد     => 'تصلب متعدد (MS)',
            self::برنامج_٢١_يوم      => 'برنامج 21 يوم',
        };
    }

    public function description(): string
    {
        return match($this) {
            self::عادي               => 'أبي نظام عادي يناسب ثقافة أكلي',
            self::عالي_البروتين      => 'نظام عالي البروتين للعضلات والشبع',
            self::نباتي              => 'نظام كامل بدون منتجات حيوانية',
            self::LiverHealth        => 'دعم صحة الكبد والحفاظ على وظائفه',
            self::السكري             => 'نظام يوازن السكر ويحافظ على الطاقة',
            self::مشاكل_القولون      => 'انتفاخ، غازات، تهيّج قولون',
            self::ارتفاع_الكوليسترول => 'نظام يقلل الدهون الضارة',
            self::فقر_الدم           => 'برنامج غني بالحديد و الفيتامينات',
            self::التصلب_المتعدد     => 'دعم الطاقة والمناعة',
            self::برنامج_٢١_يوم      => 'خسارة وزن سريعة بشكل آمن',
        };
    }

    public static function getList(): array
    {
        return array_map(fn($case) => [
            'id' => $case->value,
            'label' => $case->label(),
            'description' => $case->description(),
        ], self::cases());
    }
}
